<!DOCTYPE html>
<html lang="en" data-bs-theme="light">
    <head>
        <meta charset="utf-8">
        <meta http-equiv="X-UA-Compatible" content="IE=edge">
        <meta name="viewport" content="width=device-width, initial-scale=1.0">
        
        
        
        <link rel="shortcut icon" href="../../../../../img/favicon.ico">
        <title>Example1 - My Docs</title>
        <link href="../../../../../css/bootstrap.min.css" rel="stylesheet">
        <link href="../../../../../css/fontawesome.min.css" rel="stylesheet">
        <link href="../../../../../css/brands.min.css" rel="stylesheet">
        <link href="../../../../../css/solid.min.css" rel="stylesheet">
        <link href="../../../../../css/v4-font-face.min.css" rel="stylesheet">
        <link href="../../../../../css/base.css" rel="stylesheet">
        <link id="hljs-light" rel="stylesheet" href="https://cdnjs.cloudflare.com/ajax/libs/highlight.js/11.8.0/styles/github.min.css" >
        <link id="hljs-dark" rel="stylesheet" href="https://cdnjs.cloudflare.com/ajax/libs/highlight.js/11.8.0/styles/github-dark.min.css" disabled>
        <script src="https://cdnjs.cloudflare.com/ajax/libs/highlight.js/11.8.0/highlight.min.js"></script>
        <script>hljs.highlightAll();</script> 
    </head>

    <body>
        <div class="navbar fixed-top navbar-expand-lg navbar-dark bg-primary">
            <div class="container">
                <a class="navbar-brand" href="../../../../..">My Docs</a>
                <!-- Expander button -->
                <button type="button" class="navbar-toggler" data-bs-toggle="collapse" data-bs-target="#navbar-collapse" aria-controls="navbar-collapse" aria-expanded="false" aria-label="Toggle navigation">
                    <span class="navbar-toggler-icon"></span>
                </button>

                <!-- Expanded navigation -->
                <div id="navbar-collapse" class="navbar-collapse collapse">

                    <ul class="nav navbar-nav ms-md-auto">
                        <li class="nav-item">
                            <a href="#" class="nav-link" data-bs-toggle="modal" data-bs-target="#mkdocs_search_modal">
                                <i class="fa fa-search"></i> Search
                            </a>
                        </li>
                            <li class="nav-item">
                                <a rel="prev" href="../%E5%A4%9A%E7%BB%A7%E6%89%BF/" class="nav-link">
                                    <i class="fa fa-arrow-left"></i> Previous
                                </a>
                            </li>
                            <li class="nav-item">
                                <a rel="next" href="../../../Float%20Point/FCMP/" class="nav-link">
                                    Next <i class="fa fa-arrow-right"></i>
                                </a>
                            </li>
                    </ul>
                </div>
            </div>
        </div>

        <div class="container">
            <div class="row">
                    <div class="col-md-3"><div class="navbar-expand-md bs-sidebar hidden-print affix" role="complementary">
    <div class="navbar-header">
        <button type="button" class="navbar-toggler collapsed" data-bs-toggle="collapse" data-bs-target="#toc-collapse" title="Table of Contents">
            <span class="fa fa-angle-down"></span>
        </button>
    </div>

    
    <div id="toc-collapse" class="navbar-collapse collapse card bg-body-tertiary">
        <ul class="nav flex-column">
            
            <li class="nav-item" data-bs-level="1"><a href="#example1" class="nav-link">Example1</a>
              <ul class="nav flex-column">
            <li class="nav-item" data-bs-level="2"><a href="#result" class="nav-link">Result</a>
              <ul class="nav flex-column">
              </ul>
            </li>
              </ul>
            </li>
            
            <li class="nav-item" data-bs-level="1"><a href="#example2" class="nav-link">Example2</a>
              <ul class="nav flex-column">
              </ul>
            </li>
        </ul>
    </div>
</div></div>
                    <div class="col-md-9" role="main">

<h1 id="example1">Example1</h1>
<pre><code class="language-c++">class X {
public:
  double i;
};

class A: public virtual X {
public:
  double j;
};

class B: public virtual X {
public:
  double k;
};

class C: public A, public B {
  double l;
};

void foo() {
  C c;
}
</code></pre>
<h2 id="result">Result</h2>
<h3 id="1-gcc">1 gcc</h3>
<pre><code class="language-shell">g++ -fdump-class-hierarchy base.cpp -c
cat base.cpp.002t.class

Class X
   size=8 align=8
   base size=8 base align=8
X (0x0x3fff7a2704e0) 0

Vtable for A
A::_ZTV1A: 3u entries
0     16u
8     (int (*)(...))0
16    (int (*)(...))(&amp; _ZTI1A)

VTT for A
A::_ZTT1A: 1u entries
0     ((&amp; A::_ZTV1A) + 24u)

Class A
   size=24 align=8
   base size=16 base align=8
A (0x0x3fff7a2600d0) 0
    vptridx=0u vptr=((&amp; A::_ZTV1A) + 24u)
  X (0x0x3fff7a270540) 16 virtual
      vbaseoffset=-24

Vtable for B
B::_ZTV1B: 3u entries
0     16u
8     (int (*)(...))0
16    (int (*)(...))(&amp; _ZTI1B)

VTT for B
B::_ZTT1B: 1u entries
0     ((&amp; B::_ZTV1B) + 24u)

Class B
   size=24 align=8
   base size=16 base align=8
B (0x0x3fff7a260138) 0
    vptridx=0u vptr=((&amp; B::_ZTV1B) + 24u)
  X (0x0x3fff7a2705a0) 16 virtual
      vbaseoffset=-24

Vtable for C
C::_ZTV1C: 6u entries
0     40u
8     (int (*)(...))0
16    (int (*)(...))(&amp; _ZTI1C)
24    24u
32    (int (*)(...))-16
40    (int (*)(...))(&amp; _ZTI1C)

Construction vtable for A (0x0x3fff7a2601a0 instance) in C
C::_ZTC1C0_1A: 3u entries
0     40u
8     (int (*)(...))0
16    (int (*)(...))(&amp; _ZTI1A)

Construction vtable for B (0x0x3fff7a260208 instance) in C
C::_ZTC1C16_1B: 3u entries
0     24u
8     (int (*)(...))0
16    (int (*)(...))(&amp; _ZTI1B)

VTT for C
C::_ZTT1C: 4u entries
0     ((&amp; C::_ZTV1C) + 24u)
8     ((&amp; C::_ZTC1C0_1A) + 24u)
16    ((&amp; C::_ZTC1C16_1B) + 24u)
24    ((&amp; C::_ZTV1C) + 48u)

Class C
   size=48 align=8
   base size=40 base align=8
C (0x0x3fff82e00e70) 0
    vptridx=0u vptr=((&amp; C::_ZTV1C) + 24u)
  A (0x0x3fff7a2601a0) 0
      primary-for C (0x0x3fff82e00e70)
      subvttidx=8u
    X (0x0x3fff7a270600) 40 virtual
        vbaseoffset=-24
  B (0x0x3fff7a260208) 16
      subvttidx=16u vptridx=24u vptr=((&amp; C::_ZTV1C) + 48u)
    X (0x0x3fff7a270600) alternative-path
</code></pre>
<h3 id="2-clang">2. clang</h3>
<pre><code class="language-shell">clang++ -Xclang -fdump-record-layouts  base.cpp -c

*** Dumping AST Record Layout
         0 | class X
         0 |   double i
           | [sizeof=8, dsize=8, align=8,
           |  nvsize=8, nvalign=8]

*** Dumping AST Record Layout
         0 | class A
         0 |   (A vtable pointer)
         8 |   double j
        16 |   class X (virtual base)
        16 |     double i
           | [sizeof=24, dsize=24, align=8,
           |  nvsize=16, nvalign=8]

*** Dumping AST Record Layout
         0 | class B
         0 |   (B vtable pointer)
         8 |   double k
        16 |   class X (virtual base)
        16 |     double i
           | [sizeof=24, dsize=24, align=8,
           |  nvsize=16, nvalign=8]

*** Dumping AST Record Layout
         0 | class C
         0 |   class A (primary base)
         0 |     (A vtable pointer)   // 8
         8 |     double j             // 8
        16 |   class B (base)
        16 |     (B vtable pointer)   // 8
        24 |     double k             // 8
        32 |   double l               // 8
        40 |   class X (virtual base)
        40 |     double i             // 8
           | [sizeof=48, dsize=48, align=8,
           |  nvsize=40, nvalign=8]
</code></pre>
<p>C有2个虚表指针(A B)，指向同一个虚表</p>
<pre><code class="language-shell">Vtable for 'C' (6 entries).
   0 | vbase_offset (40)
   1 | offset_to_top (0)
   2 | C RTTI
       -- (A, 0) vtable address --
       -- (C, 0) vtable address --
   3 | vbase_offset (24)
   4 | offset_to_top (-16)
   5 | C RTTI
       -- (B, 16) vtable address --

Virtual base offset offsets for 'C' (1 entry).
   X | -24


Construction vtable for ('A', 0) in 'C' (3 entries).
   0 | vbase_offset (40)
   1 | offset_to_top (0)
   2 | A RTTI
       -- (A, 0) vtable address --

Construction vtable for ('B', 16) in 'C' (3 entries).
   0 | vbase_offset (24)
   1 | offset_to_top (0)
   2 | B RTTI
       -- (B, 16) vtable address --

</code></pre>
<hr />
<h1 id="example2">Example2</h1>
<pre><code class="language-c++">class X {
public:
  double i;
  virtual void fooX();
};

class A: public virtual X {
public:
  double j;
  virtual void fooA();
};

class B: public virtual X {
public:
  double k;
  virtual void fooB();
};

class C: public A, public B {
  double l;
  virtual void fooC();
};

void foo() {
  C c;
}
</code></pre>
<h3 id="result_1">Result:</h3>
<pre><code class="language-shell">g++ -fdump-class-hierarchy test.cpp -c
cat test.cpp.002t.class

Vtable for X
X::_ZTV1X: 3u entries
0     (int (*)(...))0
8     (int (*)(...))(&amp; _ZTI1X)
16    (int (*)(...))X::fooX

Class X
   size=16 align=8
   base size=16 base align=8
X (0x0x3fffa69204e0) 0
    vptr=((&amp; X::_ZTV1X) + 16u)

Vtable for A
A::_ZTV1A: 8u entries
0     16u
8     (int (*)(...))0
16    (int (*)(...))(&amp; _ZTI1A)
24    (int (*)(...))A::fooA
32    0u
40    (int (*)(...))-16
48    (int (*)(...))(&amp; _ZTI1A)
56    (int (*)(...))X::fooX

VTT for A
A::_ZTT1A: 2u entries
0     ((&amp; A::_ZTV1A) + 24u)
8     ((&amp; A::_ZTV1A) + 56u)

Class A
   size=32 align=8
   base size=16 base align=8
A (0x0x3fffa69100d0) 0
    vptridx=0u vptr=((&amp; A::_ZTV1A) + 24u)
  X (0x0x3fffa6920540) 16 virtual
      vptridx=8u vbaseoffset=-24 vptr=((&amp; A::_ZTV1A) + 56u)

Vtable for B
B::_ZTV1B: 8u entries
0     16u
8     (int (*)(...))0
16    (int (*)(...))(&amp; _ZTI1B)
24    (int (*)(...))B::fooB
32    0u
40    (int (*)(...))-16
48    (int (*)(...))(&amp; _ZTI1B)
56    (int (*)(...))X::fooX

VTT for B
B::_ZTT1B: 2u entries
0     ((&amp; B::_ZTV1B) + 24u)
8     ((&amp; B::_ZTV1B) + 56u)

Class B
   size=32 align=8
   base size=16 base align=8
B (0x0x3fffa69101a0) 0
    vptridx=0u vptr=((&amp; B::_ZTV1B) + 24u)
  X (0x0x3fffa69205a0) 16 virtual
      vptridx=8u vbaseoffset=-24 vptr=((&amp; B::_ZTV1B) + 56u)

Vtable for C
C::_ZTV1C: 13u entries
0     40u
8     (int (*)(...))0
16    (int (*)(...))(&amp; _ZTI1C)
24    (int (*)(...))A::fooA
32    (int (*)(...))C::fooC
40    24u
48    (int (*)(...))-16
56    (int (*)(...))(&amp; _ZTI1C)
64    (int (*)(...))B::fooB
72    0u
80    (int (*)(...))-40
88    (int (*)(...))(&amp; _ZTI1C)
96    (int (*)(...))X::fooX

Construction vtable for A (0x0x3fffa6910270 instance) in C
C::_ZTC1C0_1A: 8u entries
0     40u
8     (int (*)(...))0
16    (int (*)(...))(&amp; _ZTI1A)
24    (int (*)(...))A::fooA
32    0u
40    (int (*)(...))-40
48    (int (*)(...))(&amp; _ZTI1A)
56    (int (*)(...))X::fooX

Construction vtable for B (0x0x3fffa69102d8 instance) in C
C::_ZTC1C16_1B: 8u entries
0     24u
8     (int (*)(...))0
16    (int (*)(...))(&amp; _ZTI1B)
24    (int (*)(...))B::fooB
32    0u
40    (int (*)(...))-24
48    (int (*)(...))(&amp; _ZTI1B)
56    (int (*)(...))X::fooX

VTT for C
C::_ZTT1C: 7u entries
0     ((&amp; C::_ZTV1C) + 24u)
8     ((&amp; C::_ZTC1C0_1A) + 24u)
16    ((&amp; C::_ZTC1C0_1A) + 56u)
24    ((&amp; C::_ZTC1C16_1B) + 24u)
32    ((&amp; C::_ZTC1C16_1B) + 56u)
40    ((&amp; C::_ZTV1C) + 96u)
48    ((&amp; C::_ZTV1C) + 64u)

Class C
   size=56 align=8
   base size=40 base align=8
C (0x0x3fffaf4b0ee0) 0
    vptridx=0u vptr=((&amp; C::_ZTV1C) + 24u)
  A (0x0x3fffa6910270) 0
      primary-for C (0x0x3fffaf4b0ee0)
      subvttidx=8u
    X (0x0x3fffa6920600) 40 virtual
        vptridx=40u vbaseoffset=-24 vptr=((&amp; C::_ZTV1C) + 96u)
  B (0x0x3fffa69102d8) 16
      subvttidx=24u vptridx=48u vptr=((&amp; C::_ZTV1C) + 64u)
    X (0x0x3fffa6920600) alternative-path
</code></pre>
<h3 id="clang">clang</h3>
<pre><code class="language-shell">clang++ -Xclang -fdump-record-layouts test.cpp -c

*** Dumping AST Record Layout
         0 | class X
         0 |   (X vtable pointer)
         8 |   double i
           | [sizeof=16, dsize=16, align=8,
           |  nvsize=16, nvalign=8]

*** Dumping AST Record Layout
         0 | class A
         0 |   (A vtable pointer)
         8 |   double j
        16 |   class X (virtual base)
        16 |     (X vtable pointer)
        24 |     double i
           | [sizeof=32, dsize=32, align=8,
           |  nvsize=16, nvalign=8]

*** Dumping AST Record Layout
         0 | class B
         0 |   (B vtable pointer)
         8 |   double k
        16 |   class X (virtual base)
        16 |     (X vtable pointer)
        24 |     double i
           | [sizeof=32, dsize=32, align=8,
           |  nvsize=16, nvalign=8]

*** Dumping AST Record Layout
         0 | class C
         0 |   class A (primary base)
         0 |     (A vtable pointer)      // 8
         8 |     double j                // 8
        16 |   class B (base)
        16 |     (B vtable pointer)      // 8
        24 |     double k                // 8
        32 |   double l                  // 8
        40 |   class X (virtual base)
        40 |     (X vtable pointer)      // 8
        48 |     double i                // 8
           | [sizeof=56, dsize=56, align=8,
           |  nvsize=40, nvalign=8]
</code></pre>
<p>3个虚表指针(A B X)，因为X也有虚函数</p>
<pre><code class="language-shell">clang++ -Xclang -fdump-vtable-layouts test.cpp -c

Vtable for 'C' (13 entries).
   0 | vbase_offset (40)
   1 | offset_to_top (0)
   2 | C RTTI
       -- (A, 0) vtable address --
       -- (C, 0) vtable address --
   3 | void A::fooA()
   4 | void C::fooC()
   5 | vbase_offset (24)
   6 | offset_to_top (-16)
   7 | C RTTI
       -- (B, 16) vtable address --
   8 | void B::fooB()
   9 | vcall_offset (0)
  10 | offset_to_top (-40)
  11 | C RTTI
       -- (X, 40) vtable address --
  12 | void X::fooX()

Virtual base offset offsets for 'C' (1 entry).
   X | -24

VTable indices for 'C' (1 entries).
   1 | void C::fooC()

Vtable for 'X' (3 entries).
   0 | offset_to_top (0)
   1 | X RTTI
       -- (X, 0) vtable address --
   2 | void X::fooX()

VTable indices for 'X' (1 entries).
   0 | void X::fooX()
</code></pre></div>
            </div>
        </div>

        <footer class="col-md-12">
            <hr>
            <p>Documentation built with <a href="https://www.mkdocs.org/">MkDocs</a>.</p>
        </footer>
        <script src="../../../../../js/bootstrap.bundle.min.js"></script>
        <script>
            var base_url = "../../../../..",
                shortcuts = {"help": 191, "next": 78, "previous": 80, "search": 83};
        </script>
        <script src="../../../../../js/base.js"></script>
        <script src="../../../../../search/main.js"></script>

        <div class="modal" id="mkdocs_search_modal" tabindex="-1" role="dialog" aria-labelledby="searchModalLabel" aria-hidden="true">
    <div class="modal-dialog modal-lg">
        <div class="modal-content">
            <div class="modal-header">
                <h4 class="modal-title" id="searchModalLabel">Search</h4>
                <button type="button" class="btn-close" data-bs-dismiss="modal" aria-label="Close"></button>
            </div>
            <div class="modal-body">
                <p>From here you can search these documents. Enter your search terms below.</p>
                <form>
                    <div class="form-group">
                        <input type="search" class="form-control" placeholder="Search..." id="mkdocs-search-query" title="Type search term here">
                    </div>
                </form>
                <div id="mkdocs-search-results" data-no-results-text="No results found"></div>
            </div>
            <div class="modal-footer">
            </div>
        </div>
    </div>
</div><div class="modal" id="mkdocs_keyboard_modal" tabindex="-1" role="dialog" aria-labelledby="keyboardModalLabel" aria-hidden="true">
    <div class="modal-dialog">
        <div class="modal-content">
            <div class="modal-header">
                <h4 class="modal-title" id="keyboardModalLabel">Keyboard Shortcuts</h4>
                <button type="button" class="btn-close" data-bs-dismiss="modal" aria-label="Close"></button>
            </div>
            <div class="modal-body">
              <table class="table">
                <thead>
                  <tr>
                    <th style="width: 20%;">Keys</th>
                    <th>Action</th>
                  </tr>
                </thead>
                <tbody>
                  <tr>
                    <td class="help shortcut"><kbd>?</kbd></td>
                    <td>Open this help</td>
                  </tr>
                  <tr>
                    <td class="next shortcut"><kbd>n</kbd></td>
                    <td>Next page</td>
                  </tr>
                  <tr>
                    <td class="prev shortcut"><kbd>p</kbd></td>
                    <td>Previous page</td>
                  </tr>
                  <tr>
                    <td class="search shortcut"><kbd>s</kbd></td>
                    <td>Search</td>
                  </tr>
                </tbody>
              </table>
            </div>
            <div class="modal-footer">
            </div>
        </div>
    </div>
</div>

    </body>
</html>
