<!DOCTYPE html>
<html lang="en" data-bs-theme="light">
    <head>
        <meta charset="utf-8">
        <meta http-equiv="X-UA-Compatible" content="IE=edge">
        <meta name="viewport" content="width=device-width, initial-scale=1.0">
        
        
        
        <link rel="shortcut icon" href="../../../../../img/favicon.ico">
        <title>Print虚表虚指针 - My Docs</title>
        <link href="../../../../../css/bootstrap.min.css" rel="stylesheet">
        <link href="../../../../../css/fontawesome.min.css" rel="stylesheet">
        <link href="../../../../../css/brands.min.css" rel="stylesheet">
        <link href="../../../../../css/solid.min.css" rel="stylesheet">
        <link href="../../../../../css/v4-font-face.min.css" rel="stylesheet">
        <link href="../../../../../css/base.css" rel="stylesheet">
        <link id="hljs-light" rel="stylesheet" href="https://cdnjs.cloudflare.com/ajax/libs/highlight.js/11.8.0/styles/github.min.css" >
        <link id="hljs-dark" rel="stylesheet" href="https://cdnjs.cloudflare.com/ajax/libs/highlight.js/11.8.0/styles/github-dark.min.css" disabled>
        <script src="https://cdnjs.cloudflare.com/ajax/libs/highlight.js/11.8.0/highlight.min.js"></script>
        <script>hljs.highlightAll();</script> 
    </head>

    <body>
        <div class="navbar fixed-top navbar-expand-lg navbar-dark bg-primary">
            <div class="container">
                <a class="navbar-brand" href="../../../../..">My Docs</a>
                <!-- Expander button -->
                <button type="button" class="navbar-toggler" data-bs-toggle="collapse" data-bs-target="#navbar-collapse" aria-controls="navbar-collapse" aria-expanded="false" aria-label="Toggle navigation">
                    <span class="navbar-toggler-icon"></span>
                </button>

                <!-- Expanded navigation -->
                <div id="navbar-collapse" class="navbar-collapse collapse">

                    <ul class="nav navbar-nav ms-md-auto">
                        <li class="nav-item">
                            <a href="#" class="nav-link" data-bs-toggle="modal" data-bs-target="#mkdocs_search_modal">
                                <i class="fa fa-search"></i> Search
                            </a>
                        </li>
                            <li class="nav-item">
                                <a rel="prev" href="../C%2B%2B%E8%99%9A%E8%A1%A8%E5%9C%B0%E5%9D%80%E3%80%81%E8%99%9A%E5%87%BD%E6%95%B0%E5%9C%B0%E5%9D%80%E6%89%93%E5%8D%B0/" class="nav-link">
                                    <i class="fa fa-arrow-left"></i> Previous
                                </a>
                            </li>
                            <li class="nav-item">
                                <a rel="next" href="../%E5%8D%95%E7%BB%A7%E6%89%BF/" class="nav-link">
                                    Next <i class="fa fa-arrow-right"></i>
                                </a>
                            </li>
                    </ul>
                </div>
            </div>
        </div>

        <div class="container">
            <div class="row">
                    <div class="col-md-3"><div class="navbar-expand-md bs-sidebar hidden-print affix" role="complementary">
    <div class="navbar-header">
        <button type="button" class="navbar-toggler collapsed" data-bs-toggle="collapse" data-bs-target="#toc-collapse" title="Table of Contents">
            <span class="fa fa-angle-down"></span>
        </button>
    </div>

    
    <div id="toc-collapse" class="navbar-collapse collapse card bg-body-tertiary">
        <ul class="nav flex-column">
            
            <li class="nav-item" data-bs-level="2"><a href="#empty-case" class="nav-link">empty case</a>
              <ul class="nav flex-column">
              </ul>
            </li>
        </ul>
    </div>
</div></div>
                    <div class="col-md-9" role="main">

<p>https://blog.csdn.net/Poo_Chai/article/details/100316040</p>
<p>https://www.cnblogs.com/biterror/p/7053347.html</p>
<p>https://www.cnblogs.com/malecrab/p/5573368.html</p>
<p>用clang进行dump有两个条件：</p>
<pre><code>1. 加上 -emit-llvm   // 测试后该选项可省
2. class必须被使用   
</code></pre>
<pre><code class="language-shell">clang++ -Xclang -fdump-record-layouts  test.cpp
clang++ -Xclang -fdump-vtable-layouts  test.cpp



// 下面的方法不推荐，可能会有头文件Not found的错误
// 下面的网页中所使用的方法
// https://eli.thegreenplace.net/2012/12/17/dumping-a-c-objects-memory-layout-with-clang/
clang -cc1 -fdump-vtable-layouts -stdlib=libc++ actress.cpp
clang -cc1 -fdump-record-layouts -stdlib=libc++ actress.cpp
</code></pre>
<pre><code class="language-c++">#include &lt;stdio.h&gt;

class Actress {
public:
    Actress(int h, int w, int a):height(h),weight(w),age(a){};

    virtual void desc() {
        printf(&quot;height:%d weight:%d age:%d\n&quot;, height, weight, age);
    }

    virtual void name() {
        printf(&quot;I'm a actress&quot;);
    }

    int height; // 身高
    int weight; // 体重
    int age;    // 年龄（注意，这不是数据库，不必一定存储生日）
};

class Sensei: public Actress {
public:
    Sensei(int h, int w, int a, const char* c):Actress(h, w, a){
        snprintf(cup, sizeof(cup), &quot;%s&quot;, c);
    };
    virtual void desc() {
        printf(&quot;height:%d weight:%d age:%d cup:%s\n&quot;, height, weight, age, cup);
    }
    virtual void name() {
        printf(&quot;I'm a sensei&quot;);
    }
    char cup[4];

};

int main() {
    Sensei s(168, 50, 20, &quot;36D&quot;);
    s.desc();

    Actress* a = &amp;s;
    a-&gt;desc();

    Actress&amp; a2 = s;
    a2.desc();
    return 0;
}

</code></pre>
<p><code>clang++ -Xclang -fdump-vtable-layouts  test.cpp</code></p>
<pre><code class="language-shell">*** Dumping AST Record Layout
         0 | class Actress
         0 |   (Actress vtable pointer)
         8 |   int height
        12 |   int weight
        16 |   int age
           | [sizeof=24, dsize=20, align=8,
           |  nvsize=20, nvalign=8]

*** Dumping AST Record Layout
         0 | class Sensei
         0 |   class Actress (primary base)
         0 |     (Actress vtable pointer)
         8 |     int height
        12 |     int weight
        16 |     int age
        20 |   char [4] cup
           | [sizeof=24, dsize=24, align=8,
           |  nvsize=24, nvalign=8]
</code></pre>
<p><code>clang++ -Xclang -fdump-record-layouts  test.cpp</code></p>
<pre><code class="language-shell">Vtable for 'Actress' (4 entries).
   0 | offset_to_top (0)
   1 | Actress RTTI
       -- (Actress, 0) vtable address --
   2 | void Actress::desc()
   3 | void Actress::name()

VTable indices for 'Actress' (2 entries).
   0 | void Actress::desc()
   1 | void Actress::name()

Vtable for 'Sensei' (4 entries).
   0 | offset_to_top (0)
   1 | Sensei RTTI
       -- (Actress, 0) vtable address --
       -- (Sensei, 0) vtable address --
   2 | void Sensei::desc()
   3 | void Sensei::name()

VTable indices for 'Sensei' (2 entries).
   0 | void Sensei::desc()
   1 | void Sensei::name()
</code></pre>
<pre><code class="language-shell">g++ -fdump-class-hierarchy actress.cpp
cat main.cpp.002t.class
</code></pre>
<pre><code class="language-shell">Vtable for Actress
Actress::_ZTV7Actress: 4u entries
0     (int (*)(...))0
8     (int (*)(...))(&amp; _ZTI7Actress)
16    (int (*)(...))Actress::desc
24    (int (*)(...))Actress::name

Class Actress
   size=24 align=8
   base size=20 base align=8
Actress (0x0x7f9b1fa8c960) 0
    vptr=((&amp; Actress::_ZTV7Actress) + 16u)

Vtable for Sensei
Sensei::_ZTV6Sensei: 4u entries
0     (int (*)(...))0
8     (int (*)(...))(&amp; _ZTI6Sensei)
16    (int (*)(...))Sensei::desc
24    (int (*)(...))Sensei::name

Class Sensei
   size=24 align=8
   base size=24 base align=8
Sensei (0x0x7f9b1fa81138) 0
    vptr=((&amp; Sensei::_ZTV6Sensei) + 16u)
  Actress (0x0x7f9b1fa8c9c0) 0
      primary-for Sensei (0x0x7f9b1fa81138)
</code></pre>
<p><img alt="img" src="https://pic1.zhimg.com/80/v2-dd07c41d30e7e32f8dcb80ef55b5787a_1440w.jpg?source=1940ef5c" /></p>
<h2 id="empty-case">empty case</h2>
<pre><code class="language-c++">class Test {

};
Test test;
</code></pre>
<h3 id="clang">clang</h3>
<pre><code class="language-shell">*** Dumping AST Record Layout
         0 | class Test (empty)
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping IRgen Record Layout
Record: CXXRecordDecl 0x10014f79a80 &lt;empty.cpp:1:1, line:3:1&gt; line:1:7 referenced class Test definition
|-DefinitionData pass_in_registers empty aggregate standard_layout trivially_copyable pod trivial literal has_constexpr_non_copy_move_ctor can_const_default_init
| |-DefaultConstructor exists trivial constexpr defaulted_is_constexpr
| |-CopyConstructor simple trivial has_const_param implicit_has_const_param
| |-MoveConstructor exists simple trivial
| |-CopyAssignment simple trivial has_const_param needs_implicit implicit_has_const_param
| |-MoveAssignment exists simple trivial needs_implicit
| `-Destructor simple irrelevant trivial needs_implicit
|-CXXRecordDecl 0x10014f79ba0 &lt;col:1, col:7&gt; col:7 implicit class Test
|-CXXConstructorDecl 0x10014fcb808 &lt;col:7&gt; col:7 implicit used constexpr Test 'void () noexcept' inline default trivial
| `-CompoundStmt 0x10014fcbcf0 &lt;col:7&gt;
|-CXXConstructorDecl 0x10014fcb950 &lt;col:7&gt; col:7 implicit constexpr Test 'void (const Test &amp;)' inline default trivial noexcept-unevaluated 0x10014fcb950
| `-ParmVarDecl 0x10014fcba80 &lt;col:7&gt; col:7 'const Test &amp;'
`-CXXConstructorDecl 0x10014fcbb20 &lt;col:7&gt; col:7 implicit constexpr Test 'void (Test &amp;&amp;)' inline default trivial noexcept-unevaluated 0x10014fcbb20
  `-ParmVarDecl 0x10014fcbc50 &lt;col:7&gt; col:7 'Test &amp;&amp;'

Layout: &lt;CGRecordLayout
  LLVMType:%class.Test = type { i8 }
  NonVirtualBaseLLVMType:%class.Test = type { i8 }
  IsZeroInitializable:1
  BitFields:[
]&gt;
</code></pre>
<pre><code class="language-shell">clang -cc1 -fdump-vtable-layouts test.cpp -emit-llvm   # no virtual func, get nothing
</code></pre>
<h3 id="gcc">gcc</h3>
<p><code>g++ -fdump-class-hierarchy empty.cpp  -c</code></p>
<pre><code class="language-shell">cat empty.cpp.002t.class
Class Test
   size=1 align=1
   base size=0 base align=1
Test (0x0x3fff9ddf04e0) 0 empty

</code></pre>
<p>https://www.cnblogs.com/malecrab/p/5573368.html (有多继承等)</p>
<pre><code>“offset to top”是指到对象起始地址的偏移值，只有多重继承的情形才有可能不为0，单继承或无继承的情形都为0。
“RTTI information”是一个对象指针，它用于唯一地标识该类型。（注：本系列博文后续会有详细讨论。）
“virtual function pointers”也就是我们之前理解的虚函数表，其中存放着虚函数指针列表。
</code></pre></div>
            </div>
        </div>

        <footer class="col-md-12">
            <hr>
            <p>Documentation built with <a href="https://www.mkdocs.org/">MkDocs</a>.</p>
        </footer>
        <script src="../../../../../js/bootstrap.bundle.min.js"></script>
        <script>
            var base_url = "../../../../..",
                shortcuts = {"help": 191, "next": 78, "previous": 80, "search": 83};
        </script>
        <script src="../../../../../js/base.js"></script>
        <script src="../../../../../search/main.js"></script>

        <div class="modal" id="mkdocs_search_modal" tabindex="-1" role="dialog" aria-labelledby="searchModalLabel" aria-hidden="true">
    <div class="modal-dialog modal-lg">
        <div class="modal-content">
            <div class="modal-header">
                <h4 class="modal-title" id="searchModalLabel">Search</h4>
                <button type="button" class="btn-close" data-bs-dismiss="modal" aria-label="Close"></button>
            </div>
            <div class="modal-body">
                <p>From here you can search these documents. Enter your search terms below.</p>
                <form>
                    <div class="form-group">
                        <input type="search" class="form-control" placeholder="Search..." id="mkdocs-search-query" title="Type search term here">
                    </div>
                </form>
                <div id="mkdocs-search-results" data-no-results-text="No results found"></div>
            </div>
            <div class="modal-footer">
            </div>
        </div>
    </div>
</div><div class="modal" id="mkdocs_keyboard_modal" tabindex="-1" role="dialog" aria-labelledby="keyboardModalLabel" aria-hidden="true">
    <div class="modal-dialog">
        <div class="modal-content">
            <div class="modal-header">
                <h4 class="modal-title" id="keyboardModalLabel">Keyboard Shortcuts</h4>
                <button type="button" class="btn-close" data-bs-dismiss="modal" aria-label="Close"></button>
            </div>
            <div class="modal-body">
              <table class="table">
                <thead>
                  <tr>
                    <th style="width: 20%;">Keys</th>
                    <th>Action</th>
                  </tr>
                </thead>
                <tbody>
                  <tr>
                    <td class="help shortcut"><kbd>?</kbd></td>
                    <td>Open this help</td>
                  </tr>
                  <tr>
                    <td class="next shortcut"><kbd>n</kbd></td>
                    <td>Next page</td>
                  </tr>
                  <tr>
                    <td class="prev shortcut"><kbd>p</kbd></td>
                    <td>Previous page</td>
                  </tr>
                  <tr>
                    <td class="search shortcut"><kbd>s</kbd></td>
                    <td>Search</td>
                  </tr>
                </tbody>
              </table>
            </div>
            <div class="modal-footer">
            </div>
        </div>
    </div>
</div>

    </body>
</html>
